drivers/itemFinanciavel.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:iit="http://ITFINSolicitarCredenciamentoV2/IITFINCredenciamentoITFIN_V1" xmlns:plan="http://PlanilhaPortal110">
   <soap:Header/>
   <soap:Body>
      <iit:solicitarCredenciamento>
        <BOSolicitacaoCredenciamento>
       <!--<codigoItemFinanciavel>00070874</codigoItemFinanciavel>-->
            <Credenciamento_Produtos_CFI>
               <row Responsavel="Resp.1" Cargo="Cargo 1" Endereco="Endereço 1" Telefone="21 123456789" Email="abc@abc.com" Versao="2.0">
                  <Produtos>
                     <row NomeFabricante="Fabricante Wannisson 21167275000194 A" CNPJFabricante="21167275000194" CodigoNcm="84069011" NomeProduto="Produto Teste Mínimo" Modelo="Modelo teste mínimo" TipoProduto="Máquina ou Equipamento" PrecoVendaComImpostos="10000" BaseCalculo="8000" PercentualIPI="0.05" PercentualICMS="0" PesoLiquido="500" CodigoMoeda="019">
                        <Componentes> 
                                                                              <row Nome="Componente 001" CodigoNcm="84069011" EspecificacaoComplementar="Complementar 1" Origem="Adquirido no Mercado Interno"          Quantidade="5" UnidadeMedida="un"               ValorUnitario="2000"                 AliquotaICM="0" BaseCalculoICM="2000" AliquotaIPI="0"         PesoUnitario="15" CodigoCSTxCSOSN="100" OrigemItensFinanciaveis="Importado por Terceiros"   Acessorio="Não" Seq-Componente="CMP-1" NomeFornecedor="Hine do Brasil Ind e Com de Hidraulicos e Pneumaticos Ltda" CNPJFornecedor="12482538000169" ChaveNF="35131012482538000169550010000108901046257877" CodItemNFe="LC40DR20E7X I"/>
                                                                              <row Nome="Componente 002" CodigoNcm="84069011" EspecificacaoComplementar="Complementar 2" Origem="Adquirido no Mercado Interno"          Quantidade="7" UnidadeMedida="un"               ValorUnitario="2000"                 AliquotaICM="0" BaseCalculoICM="2000" AliquotaIPI="0"         PesoUnitario="15" CodigoCSTxCSOSN="100" OrigemItensFinanciaveis="Importado por Terceiros"   Acessorio="Não" Seq-Componente="CMP-2" NomeFornecedor="Hine do Brasil Ind e Com de Hidraulicos e Pneumaticos Ltda" CNPJFornecedor="12482538000169" ChaveNF="35131012482538000169550010000108901046257877" CodItemNFe="LFA40DR17X315"/>
                                                                              <row Nome="Componente 003" CodigoNcm="84069011" EspecificacaoComplementar="Complementar 3" Origem="Adquirido no Mercado Interno"          Quantidade="9" UnidadeMedida="un"               ValorUnitario="2000"                 AliquotaICM="0" BaseCalculoICM="1250" AliquotaIPI="0"         PesoUnitario="13" CodigoCSTxCSOSN="100" OrigemItensFinanciaveis="Importado por Terceiros"   Acessorio="Não" Seq-Componente="CMP-3" NomeFornecedor="Hine do Brasil Ind e Com de Hidraulicos e Pneumaticos Ltda" CNPJFornecedor="12482538000169" ChaveNF="35131012482538000169550010000108901046257877" CodItemNFe="DBDS-20-G1X/31"/>
                                                  </Componentes>       
                        <Servicos >
                                                                              <row  Codigo="1401"  Origem="Prestador Nacional" TotalMoedaNacional="10"  Aliquota_ISS="0.01" BaseCalculo_ISS="10" TaxaRateio="1" Seq-Servico="SRVC-10"/>
                                                                              <row  Codigo="1210"  Origem="Prestador Estrangeiro" NomePrestadora="Empresa 67393109000107" TotalUS="20" Aliquota_ISS="0.01" BaseCalculo_ISS="20" TaxaRateio="1" Seq-Servico="SRVC-20"/>
                                                                              </Servicos>
                                                                              <MaoDeObra >
                                                                                              <row  Funcao="abc" NomeCBO="Engenheiro de riscos" CodigoCBO="214920" Origem="Residente" PaisOrigem="BRA" ValorRemuneracaoMensal="1000"   JornadaTrabalho="10" ValorEncargos="100" ProdutividadeTrabalho="100"   Seq-MaoObra="MBR-1"/>
                                                                                              <row  Funcao="qwe" NomeCBO="Visitador sanitário" CodigoCBO="515120" Origem="Não-Residente" PaisOrigem="ARG" TempoUsualPermanenciaPais="20" ValorRemuneracaoAnualUS="50" JornadaTrabalho="5" ProdutividadeTrabalho="50"   Seq-MaoObra="MBR-2"/>
                                                                              </MaoDeObra>
                     </row>
                  </Produtos>
               </row>
            </Credenciamento_Produtos_CFI>
            <nuSolicitacaoCFP>1565001</nuSolicitacaoCFP>
            <CNPJ>21167275000194</CNPJ>
            <indicadorReapresentacao>false</indicadorReapresentacao>
            <nomeItemFinanciavel>ITEM FINANCIAVEL 21167275000194</nomeItemFinanciavel>
            <!--Optional:-->
            <nomeModeloItemFinanciavel>MODELO DO ITEM FINANCIAVEL2 21167275000194</nomeModeloItemFinanciavel>
            <numeroVidaUtil>360</numeroVidaUtil>
            <indicadorTecnologiaProducaoNacional>true</indicadorTecnologiaProducaoNacional>
            <indicadorPatenteTecnologica>false</indicadorPatenteTecnologica>
            <idOrigemTecnologia>1</idOrigemTecnologia>
            <!--Optional:-->
            <textoConcorrente>CONCORRENTE</textoConcorrente>
            <numeroNCM>84248111</numeroNCM>
            <indicadorPPB>false</indicadorPPB>
            <!--Zero or more repetitions:-->
            <listaPPB>
               <numeroPortariaFixacao>10</numeroPortariaFixacao>
               <dataPortariaFixacao>2015-01-01</dataPortariaFixacao>
               <numeroResolucaoHabitacao>20</numeroResolucaoHabitacao>
               <dataResolucaoHabitacao>2015-01-02</dataResolucaoHabitacao>
            </listaPPB>
            <!--Zero or more repetitions:-->
            <listaTecnologiaNacional>
               <numeroPortariaTecnologiaNacional>15</numeroPortariaTecnologiaNacional>
               <dataPortariaTecnologiaNacional>2015-05-01</dataPortariaTecnologiaNacional>
            </listaTecnologiaNacional>
            <!--1 or more repetitions:-->
            <listaCNPJUnidadeFabricacao>21167275000194</listaCNPJUnidadeFabricacao>
            <!--1 or more repetitions:-->
            <listaIdsSegmentoDemanda>5</listaIdsSegmentoDemanda>
            <indicadorTercerizacaoCompleta>false</indicadorTercerizacaoCompleta>
            <!--Optional:-->
            <breveDescricaoTecnica>Este é um produto cadastrado por Teste SoapUI</breveDescricaoTecnica>
            <!--Zero or more repetitions:-->
            <listaCaracteristicaTecnica>
               <caracteristicaTecnica>ALTURA</caracteristicaTecnica>
               <valorCaracteristicaTecnica>1</valorCaracteristicaTecnica>
               <unidadeMedida>cx</unidadeMedida>
            </listaCaracteristicaTecnica>
            <!--Zero or more repetitions:-->
            <listaFamilia>
               <!--Optional:-->
               <codigoNFeFamilia>12345F37</codigoNFeFamilia>
               <!--Optional:-->
               <descricaoFamilia>FAMILIA SOAPUI</descricaoFamilia>
            </listaFamilia>
            <responsavelSolicitacao>
               <responsavel>Responsável SoapUI em 04/11/2015 17:40:16</responsavel>
               <!--Optional:-->
               <cargo>Teste Automatizado</cargo>
               <!--Optional:-->
               <telefone>2105368410</telefone>
               <!--Optional:-->
               <email>teste@soapui.com</email>
            </responsavelSolicitacao>
            <IndicadorRespostaExigencia>false</IndicadorRespostaExigencia>
         </BOSolicitacaoCredenciamento>
      </iit:solicitarCredenciamento>
   </soap:Body>
</soap:Envelope>